brew "beanstalk"
brew "brew-cask"
brew "composer"
brew "ctags"
brew "dnsmasq"
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "erlang"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "go"
brew "httpie"
brew "imagemagick"
brew "lame"
brew "markdown"
brew "minicom"
brew "mongodb"
brew "mysql"
brew "ngrep"
brew "node"
brew "openssl"

tap "homebrew/dupes"
tap "homebrew/php"

brew "php56"
brew "php56-mcrypt"
brew "phpsh"

brew "pkgconfig"
brew "postgresql"
brew "python"
brew "python3"
brew "redis"
brew "sbt"
brew "scala"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "wget"
brew "wireshark"
brew "x264"
brew "zlib"
brew "zsh"
brew "z"

# Casks
brew "caskroom/cask/brew-cask"
cask "1password"
cask "alfred"
cask "bartender"
cask "firefox"
cask "flash"
cask "google-chrome"
cask "java"
cask "iterm2"
cask "chitchat"
cask "nylas-n1"
cask "clamxav"
cask "cloak"
cask "crashplan"
cask "crossover"
cask "cyberduck"
cask "dropbox"
cask "google-drive"
cask "mpeg-streamclip"
cask "moom"
cask "mou"
cask "onyx"
cask "skype"
cask "slack"
cask "telegram"
cask "texstudio"
cask "mactex"
cask "torbrowser"
cask "the-unarchiver"
cask "ubersicht"
cask "vlc"

