# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# ====================================================
# Install all utilities and applications with Homebrew
# ====================================================
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# Prerequisites
tap "homebrew/dupes"
tap "caskroom/cask"

# --------------------------------------------
# Utilities
# --------------------------------------------

# Text/file utilities
# https://www.gnu.org/software/coreutils/manual/coreutils.html#toc-Output-of-entire-files-1
brew "coreutils"

# Super fast fuzzy finder (fzf and ag)
brew "fzf"
brew "the_silver_searcher"

# Image / video / audio processing
brew "ffmpeg"
brew "imagemagick"
brew "lame"

# Programming stacks / languages
brew "ansible" # deploying servers
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "git"
brew "go"
brew "haskell-stack"
brew "leiningen" # clojure
brew "markdown"
brew "node"
brew "nvm" # node version manager
brew "postgresql"
brew "python3"
brew "yarn" # alternative to npm (and better)

# Hacker toolkit
brew "bat" # nicer than cat
brew "jq" # json processing / querying / display
brew "nvim" # editor
brew "reattach-to-user-namespace" # for tmux
brew "tmux" # terminal multiplexer
brew "universal-ctags" # for code navigation
brew "wireshark" # network analysis / packet sniffing
brew "zsh" # #shellbae

# Text processing
brew "pandoc" # compiling markdown / latex
brew "par" # formatting

# Misc
brew "clamav" # antivirus
brew "cowsay" # say things with cows
brew "curl" # for HTTP interactions
brew "hugo" # for static site generation
brew "jrnl" # for my journals / diaries
brew "minicom" # serial port interface
brew "openssl" # override system openssl
brew "rsync" # file transfer
brew "tree" # show folder trees
brew "w3m" # terminal-based web browser
brew "wget" # useful for file downloads vs curl
brew "wifi-password" # get the wifi password for current network
brew "z" # jumping to directories instantly

#
# Applications
#

cask "1password" # password management
cask "adapter" # Useful video converter GUI
cask "alfred" # factotum (file finding / actions / etc.)
cask "bartender" # collapses menu bar items as there are too many
cask "bettertouchtool" # gestures and shortcuts (+ window moving)
cask "blender" # 3d modelling
cask "daisydisk" # find out what's using all my space
cask "dropbox" # file sync
cask "evernote" # note taking
cask "firefox" # preferred browser
cask "gifox" # recording gifs (for screencasts)
cask "gimp" # image editor
cask "karabiner-elements" # modify keyboard mapping
cask "kitty" # GPU-based terminal emulator
cask "libreoffice" # openoffice alternative
cask "little-snitch" # network monitoring
cask "mactex" # latex for mac
cask "micro-snitch" # cam / mic usage monitoring
cask "microsoft-office" # M$ office
cask "moom" # window snapping / tiling
cask "mullvadvpn" # My VPN provider
cask "osxfuse" # FUSE for mounting filesystems
cask "postbox" # mail client
cask "remember-the-milk" # Task list app
cask "sip" # colour picker
cask "skype" # videocalls
cask "slack" # instant messaging
cask "spotify" # music streaming
cask "the-unarchiver" # useful archive extractor
cask "torbrowser" # for when you're in a dodgy country
cask "transmission" # torrent client
cask "tunnelblick" # VPN config
cask "virtualbox" # VMs
cask "virtualbox-extension-pack" # VM extensions
cask "vlc" # Media player
cask "whatsapp" # Whatsapp desktop client
cask "zoomus" # great videoconf software
