# Prerequisites
tap "homebrew/dupes"
tap "caskroom/cask"

# Brew install
brew "awscli"
brew "beanstalkd"
brew "boost"
brew "coreutils"
brew "ctags"
brew "dnsmasq"
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "erlang"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "go"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "lame"
brew "markdown"
brew "minicom"
brew "mongodb"
brew "ngrep"
brew "node"
brew "nvm"
brew "openssl"
brew "par"
brew "perl"
brew "pkgconfig"
brew "postgresql"
brew "python"
brew "python3"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "sbt"
brew "scala"
brew "task"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "wifi-password"
brew "wireshark"
brew "x264"
brew "z"
brew "zlib"
brew "zsh"

# Casks
cask "1password"
cask "alfred"
cask "balsamiq-mockups"
cask "bartender"
cask "bettertouchtool"
cask "brave"
cask "chitchat"
cask "clamxav"
cask "cloak"
cask "crashplan"
cask "crossover"
cask "cyberduck"
cask "dropbox"
cask "firefox"
cask "flash"
cask "franz"
cask "google-chrome"
cask "google-drive"
cask "hyperterm"
cask "iterm2"
cask "java"
cask "libreoffice"
cask "mactex"
cask "moom"
cask "mou"
cask "mpeg-streamclip"
cask "onyx"
cask "osxfuse"
cask "rocket"
cask "skype"
cask "slack"
cask "telegram"
cask "texstudio"
cask "the-unarchiver"
cask "torbrowser"
cask "tunnelblick"
cask "ubersicht"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"

